src/cf/DataProcessors/МаркетплейсOzon.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МаркетплейсOzon</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВидыМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМаркетплейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсЯндексМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсOzon</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийОтчетКомиссионера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОтчетКомиссионера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтчетКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетКомиссионераОВозвратах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаИВозврат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/МаркетплейсOzon/Forms/ЗагрузкаОтчетаОРеализации/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	ВидМаркетплейс = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon;
		
	Если ЗначениеЗаполнено(Организация) Тогда
		ЗаполнитьНастройки();
	КонецЕсли;
	
	Элементы.Организация.Видимость = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	КлючСохраненияПоложенияОкна = ВидМаркетплейс;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьНастройкаИнтеграцииМаркетплейс"
		И ЗначениеЗаполнено(Параметр) Тогда

		УчетнаяЗаписьМаркетплейса = Параметр;
		ИнтеграцияНастроена = OzonПроверитьДанныеАвторизацииПомещеныВХранилище(УчетнаяЗаписьМаркетплейса);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеПериодаOZONОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// ограничение API OZON
	ОграничениеСнизу = ДобавитьМесяц(НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса()),-5);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НачалоПериода",     НачалоМесяца(НачалоПериода));
	ПараметрыВыбора.Вставить("КонецПериода",      КонецМесяца(НачалоПериода));
	ПараметрыВыбора.Вставить("ОграничениеСнизу",  ОграничениеСнизу);
	ПараметрыВыбора.Вставить("ВидПериода",        ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПериодЗавершениеВыбора", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаМесяц", 
		ПараметрыВыбора, Элементы.ПредставлениеПериодаМесяц, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УчетнаяЗаписьМаркетплейса = Неопределено;
	ЗаполнитьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настроить(Команда)
	
	РедактироватьНастройку();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОтчет(Команда)
		
	Если Не ИнтеграцияНастроена Тогда
		РедактироватьНастройку();
		Возврат;
	КонецЕсли;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОкончаниеПериода = КонецМесяца(НачалоПериода);
	
	ПараметрыОтчета = ИнтеграцияСМаркетплейсамиКлиентСервер.ОтчетОРеализацииТоваровПараметрыОтчетаНовый();
	ПараметрыОтчета.УчетнаяЗаписьМаркетплейса = УчетнаяЗаписьМаркетплейса;
	ПараметрыОтчета.Организация = Организация;
	ПараметрыОтчета.НачалоПериода = НачалоПериода;
	ПараметрыОтчета.ОкончаниеПериода = ОкончаниеПериода;
	
	НачатьЗагрузкуОтчета(ПараметрыОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция OzonПроверитьДанныеАвторизацииПомещеныВХранилище(УчетнаяЗапись)
	Возврат ИнтеграцияСМаркетплейсомOzonСервер.OzonПроверитьДанныеАвторизацииПомещеныВХранилище(УчетнаяЗапись);
КонецФункции

&НаСервере
Процедура УстановитьПериод()
	
	ДатаВходящегоДокумента = ДатаПоследнегоВходящегоРозничногоОтчетаКомиссионера(УчетнаяЗаписьМаркетплейса);
	
	НачалоПериода = НачалоМесяца(НачалоМесяца(ТекущаяДатаСеанса())-1);
	
	Если ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		СледующийПериод = КонецМесяца(ДатаВходящегоДокумента)+1;
		НачалоПериода = Мин(НачалоПериода, СледующийПериод);
	КонецЕсли;
	
	ПредставлениеПериода = ПолучитьПредставлениеПериода(НачалоМесяца(НачалоПериода), КонецМесяца(НачалоПериода));
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	
	УчетнаяЗаписьМаркетплейса = ИнтеграцияСМаркетплейсомOzonСервер.УчетнаяЗаписьМаркетплейсаПоОрганизацииПолучить( Организация );
	УстановитьПериод(); 
	ИнтеграцияНастроена = ИнтеграцияСМаркетплейсомOzonСервер.OzonПроверитьДанныеАвторизацииПомещеныВХранилище( УчетнаяЗаписьМаркетплейса );
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеПериода(НачалоПериода = '00010101', КонецПериода = '00010101')
	
	ТекстПериод = "";
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда
		ТекстПериод = ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП = Истина");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, СтрНайти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Возврат ТекстПериод;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДатаПоследнегоВходящегоРозничногоОтчетаКомиссионера(Знач УчетнаяЗаписьМаркетплейса, Знач ДатаОтчета = Неопределено)
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗаписьМаркетплейса, "Организация");
	//!!!!!Контрагент = Справочники.НастройкиИнтеграцииМаркетплейс.КонтрагентДоговорНаДату(УчетнаяЗаписьМаркетплейса, ДатаОтчета).Контрагент;
	Контрагент = Неопределено;
	
	ДатаВходящегоДокумента = Дата(1, 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОтчетКомиссионера.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Организация = &Организация
	|	И ОтчетКомиссионера.Контрагент = &Контрагент
	|	И ОтчетКомиссионера.ВидОперации = &ВидОперации
	|	И ОтчетКомиссионера.Проведен
	|	И &УсловиеПоДатаВходящегодокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтчетКомиссионера.ДатаВходящегоДокумента УБЫВ,
	|	ОтчетКомиссионера.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийОтчетКомиссионера.ОтчетКомиссионера);
	Запрос.УстановитьПараметр("ДатаВходящегоДокумента", ДатаОтчета);
	
	Если ЗначениеЗаполнено(ДатаОтчета) тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&УсловиеПоДатаВходящегодокумента",
			"ОтчетКомиссионера.ДатаВходящегоДокумента  = &ДатаВходящегоДокумента");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&УсловиеПоДатаВходящегодокумента",
			"ОтчетКомиссионера.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1,1,1)");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаВходящегоДокумента = Выборка.ДатаВходящегоДокумента;
	КонецЕСли;
	
	Возврат ДатаВходящегоДокумента;
	
КонецФункции

&НаКлиенте
Процедура НачатьЗагрузкуОтчета(ПараметрыОтчета)
	
	Закрыть(ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНастройку()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите организацию, для которой требуется настройка'"),,
		"Организация");
		Возврат;
	КонецЕсли;
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить( "Организация", Организация );
	ИнтеграцияСМаркетплейсомOzonКлиент.ОткрытьНастройкуИнтеграции( УчетнаяЗаписьМаркетплейса, ПараметрыФункции );
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗавершениеВыбора(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		НачалоПериода = НачалоМесяца(РезультатВыбора.НачалоПериода);
	КонецЕсли;
	
	ПредставлениеПериода = ПолучитьПредставлениеПериода( НачалоМесяца(НачалоПериода), КонецМесяца(НачалоПериода) );
	
КонецПроцедуры

#КонецОбласти
